#### 시리즈 만들기

In [200]:
import pandas as pd

In [201]:
# Series() 메소드에 리스트를 전달하여 시리즈 생성
s = pd.Series(['Wes Mckinney', 'Creatoe of Pandas'])
print(s)

0         Wes Mckinney
1    Creatoe of Pandas
dtype: object

 - 인덱스는 보통 0부터 시작하는 정수형태이지만 문자열로 사용 가능
 - index 인자에 문자열을 리스트로 담아서 전달

In [202]:
s = pd.Series(['Wes Mckinney', 'Creator of Pandas'], index=['Person', 'Who'])
print(s)

Person         Wes Mckinney
Who       Creator of Pandas
dtype: object

In [203]:
# 데이터 프레임 만들기
scientists = pd.DataFrame({
    'Name' : ['Rosaline Franklin', 'William Gosset'],
    'Occupation' : ['Chemist', 'Statistician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age' : [37,61] })
print(scientists)

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [204]:
# DataFrame() 메소드에 딕셔너리를 전달하여 데이터프레임 생성
scientists = pd.DataFrame(
    data = {'Occupation' : ['Chemist', 'Statistician'],
            'Born' : ['1920-07-25', '1876-06-13'],
            'Died' : ['1958-04-16', '1937-10-16'],
            'Age' : [37,61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Age', 'Died'])
print(scientists)

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [205]:
# 데이터프레임에서 시리즈 선택하기
scientists = pd.DataFrame(
    data = {'Occupation' : ['Chemist', 'Statistician'],
            'Born' : ['1920-07-25', '1876-06-13'],
            'Died' : ['1958-04-16', '1937-10-16'],
            'Age' : [37,61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Age', 'Died'])

first_row = scientists.loc['William Gosset']
print(type(first_row))
print(first_row)

<class 'pandas.core.series.Series'>
Occupation    Statistician
Born            1876-06-13
Age                     61
Died            1937-10-16
Name: William Gosset, dtype: object

In [206]:
# iloc
first_irow = scientists.iloc[1]
print(type(first_irow))
print(first_irow)

<class 'pandas.core.series.Series'>
Occupation    Statistician
Born            1876-06-13
Age                     61
Died            1937-10-16
Name: William Gosset, dtype: object

In [207]:
# index 속성 사용하기
print(first_row.index)

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [208]:
# values 속성 사용하기
print(first_row.values)

['Statistician' '1876-06-13' 61 '1937-10-16']

In [209]:
# keys() 메소드 사용하기 (==index 속성)
print(first_row.keys())

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

#### 기초 통계 메소드 사용하기

In [210]:
# scientists 데이터프레임의 Age 열 추출
ages = scientists['Age']
print(ages)

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [211]:
# mean(), min(), max(), std()
print(ages.mean())
print(ages.min())
print(ages.max())
print(ages.std())

49.0
37
61
16.97056274847714

In [212]:
scientists.describe()

             Age
count   2.000000
mean   49.000000
std    16.970563
min    37.000000
25%    43.000000
50%    49.000000
75%    55.000000
max    61.000000

#### 평균 나이보다 나이가 많은 사람 데이터 구하기

In [213]:
# 최대값, 평균 메소드로 값 확인
scientists = pd.read_csv('C:/STUDY/data/scientists.csv')
ages = scientists['Age']
print(ages.max(), ages.mean())

90 59.125

In [214]:
print(ages.describe().loc[['max','mean']])

max     90.000
mean    59.125
Name: Age, dtype: float64

In [215]:
# Boolean Array 추출
print(ages > ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [216]:
# 리스트 형태로 참이나 거짓을 담아 시리즈에 전달하면 해당 데이터만 추출
manual_bool_values = [False, True, True, True, False, False, False, True]
print(ages[manual_bool_values])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [217]:
# Boolean Array 추출 후 시리즈로 전달
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

#### 브로드캐스팅(Broadcasting)
 - 시리즈와 같이 여러개의 값을 가진 데이터(벡터)와 단순 크기를 나타내는 데이터(스칼라) 간의 연산을 지원하는 것
 - 2를 곱하면 숫자는 2를 곱하고 문자열은 2배로 늘어남

In [218]:
print(ages + ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [219]:
print(ages + 100)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [220]:
# 길이가 서로 다른 벡터를 연산하는 경우 > 같은 인덱스의 값만 계산
print(ages + pd.Series([1,100]))

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [221]:
# sort_index([ascending=False])
rev_ages = ages.sort_index(ascending=False)
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [222]:
print(ages* 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [223]:
print(ages+rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

#### Boolean Array
 - 데이터 프레임의 Age 열의 평균보다 높은 데이터 출력

In [224]:
scientists = pd.read_csv('C:/STUDY/data/scientists.csv')
print(scientists[scientists['Age'] > scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [225]:
print(scientists[[True, True, False, True, True, True, False, True]])

                Name        Born        Died  Age     Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37        Chemist
1     William Gosset  1876-06-13  1937-10-16   61   Statistician
3        Marie Curie  1867-11-07  1934-07-04   66        Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56      Biologist
5          John Snow  1813-03-15  1858-06-16   45      Physician
7       Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [226]:
scientists[scientists['Occupation'] == 'Chemist']

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist
3        Marie Curie  1867-11-07  1934-07-04   66    Chemist

In [227]:
# 브로드캐스팅
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

#### 열의 자료형 바꾸기

In [228]:
# scientists 데이터프레임의 Born과 Died 열의 자료형 확인
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [229]:
# 'Born' 열의 날짜 형식 문자열을 datetime 자료형으로 변경
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [230]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [231]:
# datetime으로 바뀐 2개의 자료를 새로운 열로 추가
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
print(scientists.head())

                   Name        Born        Died  Age    Occupation    born_dt  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist 1920-07-25
1        William Gosset  1876-06-13  1937-10-16   61  Statistician 1876-06-13
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse 1820-05-12
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist 1867-11-07
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist 1907-05-27

     died_dt
0 1958-04-16
1 1937-10-16
2 1910-08-13
3 1934-07-04
4 1964-04-14

In [232]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   born_dt     8 non-null      datetime64[ns]
 6   died_dt     8 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(4)
memory usage: 576.0+ bytes

In [233]:
scientist2 = scientists.loc[:  ,['Name', 'born_dt', 'died_dt', 'Age', 'Occupation' ]]
scientist2

                   Name    born_dt    died_dt  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [234]:
# 과학자 삶의 시간 계산하기 ( died_dt - born_dt )
scientists['age_days_dt'] = (scientists['died_dt'] - scientists['born_dt'])
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

#### 데이터 삭제하기 - drop(['인덱스' 또는 '열 이름'][,axis=n])

In [235]:
# 인덱스(행) 삭제
scientists.drop(0).head(2)

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days

In [236]:
# 여러 개의 인덱스(행) 삭제
scientists.drop([0, 1]).head(2)

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days

In [237]:
# 열 삭제
scientists.drop('Age', axis=1).head(2)

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days

In [238]:
scientists.drop(['Age', 'Occupation'], axis=1).head(2)

                Name        Born        Died    born_dt    died_dt age_days_dt
0  Rosaline Franklin  1920-07-25  1958-04-16 1920-07-25 1958-04-16  13779 days
1     William Gosset  1876-06-13  1937-10-16 1876-06-13 1937-10-16  22404 days

In [239]:
## 
list1 = [1,2,3]
list2 = list1.copy()
list1 is list2
# list1을 바꾸면 list2에도 적용이 된다
# 같은 데이터긴하지만 is쓰면 False가 나옴
# inplace=True기억하기

False

#### pickle
 - 데이터를 바이너리 형태로 직렬화 하여 저장
 - 적은 용량으로 저장 가능

In [240]:
names = scientists['Name']

In [241]:
names.to_pickle('scientists_names_series.pickle')

In [242]:
scientists.to_pickle('scientists_df.pickle')

In [243]:
# 바이너리 형태로 불러오기
pd.read_pickle('scientists_df.pickle')

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [244]:
# csv, TSV
scientists['Name'].to_csv('scientists_names_series.csv')
scientists.to_csv('scientists_df.csv', sep='\t')

In [245]:
scientists.to_csv('scientists.csv')

In [284]:
## 인덱스 설정
df = pd.read_csv('scientists.csv', index_col = 0)
df

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [285]:
df

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [248]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [271]:
## 이부분에서 인덱스 늘어나게하는거 ##

df = pd.read_csv('scientists.csv', index_col=1)

In [272]:
df

,Unnamed: 0,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
Name,,,,,,,,
Rosaline Franklin,0,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
William Gosset,1,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
Florence Nightingale,2,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
Marie Curie,3,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
Rachel Carson,4,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
John Snow,5,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
Alan Turing,6,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
Johann Gauss,7,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [250]:
 # !conda install -y openpyxl

In [251]:
# Excel 저장하기
names_df = scientists['Name'].to_frame()

In [252]:
import xlwt
import openpyxl

In [253]:
# names_df.to_excel('scientists_names_series_df.xls')
# names_df.to_excel('scientists_names_series_df.xlsx')

In [254]:
# pip install xlrd

In [255]:
pd.read_excel('scientists_names_series_df.xls', index_col=0)
pd.read_excel('scientists_df.xls', index_col=0)

FileNotFoundError: [Errno 2] No such file or directory: 'scientists_names_series_df.xls'